task3_cylinder_current/constant/polyMesh/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;
vertices
(
    ( 0   0   0    )  // 0
    ( 20  0   0    )  // 1
    ( 20  4   0    )  // 2
    ( 0   4   0    )  // 3
    ( 0   0   0.65 )  // 4
    ( 20  0   0.65 )  // 5
    ( 20  4   0.65 )  // 6
    ( 0   4   0.65 )  // 7
    ( 0   0   0.95 )  // 8
    ( 20  0   0.95 )  // 9
    ( 20  4   0.95 )  // 10
    ( 0   4   0.95 )  // 11
    ( 0   0   1.2  )  // 12
    ( 20  0   1.2  )  // 13
    ( 20  4   1.2  )  // 14
    ( 0   4   1.2  )  // 15
);
blocks
(
    hex (0 1 2 3 4 5 6 7)      ( 400 15 20 ) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11)    ( 400 15 40 ) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15)( 400 15 15 ) simpleGrading (1 1 1)
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
        );
    }
    bottom
    {
        type wall;
        faces ( (0 1 2 3) );
    }
    atmosphere
    {
        type patch;
        faces ( (12 13 14 15) );
    }
    frontAndBack
    {
        type slip;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
        );
    }
);
